{
    "architectures": [
        "GlmMoeDsaForCausalLM"
    ],
    "model_type": "glm_moe_dsa",
    "vocab_size": 32256,
    "hidden_size": 256,
    "intermediate_size": 512,
    "moe_intermediate_size": 128,
    "num_hidden_layers": 4,
    "num_attention_heads": 8,
    "num_key_value_heads": 8,
    "n_shared_experts": 1,
    "n_routed_experts": 8,
    "routed_scaling_factor": 2.5,
    "kv_lora_rank": 64,
    "q_lora_rank": 128,
    "qk_rope_head_dim": 32,
    "qk_nope_head_dim": 64,
    "v_head_dim": 64,
    "n_group": 1,
    "topk_group": 1,
    "num_experts_per_tok": 2,
    "norm_topk_prob": true,
    "hidden_act": "silu",
    "max_position_embeddings": 4096,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "use_cache": true,
    "bos_token_id": 0,
    "eos_token_id": 1,
    "tie_word_embeddings": false,
    "rope_parameters": {
        "rope_type": "default",
        "rope_theta": 10000.0
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "index_topk": 16,
    "index_head_dim": 64,
    "index_n_heads": 4,
    "transformers_version": "5.2.0",
    "dtype": "bfloat16"
}
