{
  "architectures": [
    "DeepseekV4ForCausalLM"
  ],
  "model_type": "deepseek_v4",
  "vocab_size": 1024,
  "hidden_size": 256,
  "moe_intermediate_size": 128,
  "num_hidden_layers": 4,
  "num_attention_heads": 8,
  "num_key_value_heads": 1,
  "head_dim": 64,
  "q_lora_rank": 64,
  "partial_rotary_factor": 0.25,
  "num_experts_per_tok": 2,
  "n_routed_experts": 8,
  "n_shared_experts": 1,
  "scoring_func": "sqrtsoftplus",
  "norm_topk_prob": true,
  "routed_scaling_factor": 1.5,
  "max_position_embeddings": 4096,
  "rope_theta": 10000.0,
  "compress_rope_theta": 160000.0,
  "compress_rates": {
    "compressed_sparse_attention": 4,
    "heavily_compressed_attention": 32
  },
  "hc_mult": 4,
  "hc_sinkhorn_iters": 4,
  "hc_eps": 1e-06,
  "swiglu_limit": 10.0,
  "sliding_window": 32,
  "o_groups": 2,
  "o_lora_rank": 64,
  "index_n_heads": 8,
  "index_head_dim": 16,
  "index_topk": 32,
  "num_nextn_predict_layers": 0,
  "output_router_logits": false,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "tie_word_embeddings": false,
  "attention_bias": false,
  "mlp_bias": false,
  "attention_dropout": 0.0,
  "torch_dtype": "bfloat16",
  "transformers_version": "5.9.0"
}
