{
    "add_projector": false,
    "aligner_depth": 2,
    "aligner_input_dim": 1024,
    "aligner_projector_type": "mlp_gelu",
    "class_token": false,
    "global_pool": "map",
    "heads": 16,
    "ignore_head": true,
    "image_size": 384,
    "initializer_range": 0.02,
    "layers": 2,
    "mlp_ratio": 4,
    "model_type": "janussiglip_encoder",
    "n_embed": 2048,
    "num_classes": 0,
    "output_size": null,
    "patch_size": 16,
    "pixel_mean": null,
    "pixel_std": null,
    "select_feature": "same",
    "select_layer": -1,
    "transformers_version": "4.49.0",
    "use_checkpoint": false,
    "weight_init": "skip",
    "width": 1024
  }
