{
  "architectures": [
    "GptOssForCausalLM"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 199998,
  "eos_token_id": 199999,
  "head_dim": 4,
  "hidden_act": "silu",
  "hidden_size": 16,
  "initializer_range": 0.02,
  "intermediate_size": 16,
  "layer_types": [
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 128,
  "model_type": "gpt_oss",
  "num_attention_heads": 4,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "num_local_experts": 4,
  "output_router_logits": false,
  "pad_token_id": 199999,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "beta_fast": 32.0,
    "beta_slow": 1.0,
    "factor": 32.0,
    "original_max_position_embeddings": 128,
    "rope_type": "yarn",
    "truncate": false
  },
  "router_aux_loss_coef": 0.001,
  "sliding_window": 8,
  "tie_word_embeddings": false,
  "use_cache": true,
  "vocab_size": 200000
}
